app/views/comments/_form.html.haml

    = f.label :state_id
    = f.select :state_id, @states.map { |s| [s.name, s.id] }, :selected => @comment.state_id
---
SELECT "states".* FROM "states"