app/controllers/api/v1/comments_controller.rb

  def index
    respond_with(Comment.all)
---
SELECT "comments".* FROM "comments"