app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    if @comment.save
---
INSERT INTO "comments" ("created_at", "state_id", "text", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Wed, 18 Sep 2013 00:14:29 UTC +00:00], ["state_id", 1], ["text", "nuevo"], ["updated_at", Wed, 18 Sep 2013 00:14:29 UTC +00:00]]